valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
#include "ILI9341_FSMC.h"
#include "XPT2046.h"
#include "font.h"
#include "pressure_control_config.h"
#include "advanced_pressure_control.h"
#include "stm32f4xx_hal.h"
#include <math.h>
#include <string.h>
#include <stdio.h>

/* External handles */
extern SPI_HandleTypeDef hspi1;
extern ADC_HandleTypeDef hadc3;

/* XPT2046 Commands */
#define XPT2046_CMD_READ_X      0x90  /* Read X position */
#define XPT2046_CMD_READ_Y      0xD0  /* Read Y position */

/* FSMC init funksiyası main.c-də var, burada dublikat yox */

/* Sadə yazma köməkçiləri */
static inline void lcd_write_command(uint16_t cmd)
{
    LCD_REG = cmd;
}
static inline void lcd_write_data(uint16_t data)
{
    LCD_RAM = data;
}

/* ------------------ ILI9341 INIT ------------------ */
void ILI9341_Init(void)
{
    /* Backlight ON */
    HAL_GPIO_WritePin(LCD_LIG_GPIO_Port, LCD_LIG_Pin, GPIO_PIN_SET);

    /* HW reset pulse */
    HAL_GPIO_WritePin(LCD_RST_GPIO_Port, LCD_RST_Pin, GPIO_PIN_RESET);
    HAL_Delay(10);
    HAL_GPIO_WritePin(LCD_RST_GPIO_Port, LCD_RST_Pin, GPIO_PIN_SET);
    HAL_Delay(120);

    /* ILI9341 initialization sequence */
    lcd_write_command(0x01); HAL_Delay(5);    /* Software Reset */
    lcd_write_command(0x28);                  /* Display OFF */

    lcd_write_command(0x3A);                  /* Pixel Format Set */
    lcd_write_data(0x55);                     /* 16-bit/pixel */

    lcd_write_command(0x36);                  /* Memory Access Control */
    lcd_write_data(0x28);                     /* MX=0, MY=1, MV=0, BGR=1 (Landscape 320x240) */

    /* Display ON */
    lcd_write_command(0x11); HAL_Delay(120);  /* Sleep Out */
    lcd_write_command(0x29);                  /* Display ON */
}

/* ------------------ Ekranı rənglə doldur ------------------ */
void ILI9341_FillScreen(uint16_t color)
{
    uint32_t px = 320UL * 240UL;

    /* RAM write (CASET/RASET landscape 320x240) */
    lcd_write_command(0x2A);  /* Column addr set */
    lcd_write_data(0x00); lcd_write_data(0x00);
    lcd_write_data(0x01); lcd_write_data(0x3F); /* 319 */

    lcd_write_command(0x2B);  /* Row addr set */
    lcd_write_data(0x00); lcd_write_data(0x00);
    lcd_write_data(0x00); lcd_write_data(0xEF); /* 239 */

    lcd_write_command(0x2C);  /* RAMWR */

    while (px--) {
        LCD_RAM = color;
    }
}

/* ------------------ Pixel çək ------------------ */
void ILI9341_DrawPixel(uint16_t x, uint16_t y, uint16_t color)
{
    if (x >= 320 || y >= 240) return;

    /* Set address */
    lcd_write_command(0x2A);
    lcd_write_data(x >> 8); lcd_write_data(x & 0xFF);
    lcd_write_data(x >> 8); lcd_write_data(x & 0xFF);

    lcd_write_command(0x2B);
    lcd_write_data(y >> 8); lcd_write_data(y & 0xFF);
    lcd_write_data(y >> 8); lcd_write_data(y & 0xFF);

    lcd_write_command(0x2C);
    LCD_RAM = color;
}

/* ------------------ Düzbucaqlı çək ------------------ */
void ILI9341_DrawRectangle(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t color)
{
    for (uint16_t i = 0; i < height; i++) {
        for (uint16_t j = 0; j < width; j++) {
            ILI9341_DrawPixel(x + j, y + i, color);
        }
    }
}

/* ------------------ Xətt çək ------------------ */
void ILI9341_DrawLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t color)
{
    int16_t dx = abs(x2 - x1);
    int16_t dy = abs(y2 - y1);
    int16_t sx = (x1 < x2) ? 1 : -1;
    int16_t sy = (y1 < y2) ? 1 : -1;
    int16_t err = dx - dy;

    while (1) {
        ILI9341_DrawPixel(x1, y1, color);
        if (x1 == x2 && y1 == y2) break;
        int16_t e2 = 2 * err;
        if (e2 > -dy) { err -= dy; x1 += sx; }
        if (e2 < dx) { err += dx; y1 += sy; }
    }
}

/* ------------------ Menu sistemi ------------------ */
static uint8_t current_page = 0;

typedef struct {
    uint16_t x, y, width, height;
    uint16_t color;
    char text[20];
} Button_t;

void ILI9341_DrawButton(Button_t *btn)
{
    // 3D button effect - raised appearance
    // Main button area
    ILI9341_DrawRectangle(btn->x, btn->y, btn->width, btn->height, btn->color);
    
    // Top and left edges (light)
    ILI9341_DrawLine(btn->x, btn->y, btn->x + btn->width - 1, btn->y, ILI9341_COLOR_WHITE);
    ILI9341_DrawLine(btn->x, btn->y, btn->x, btn->y + btn->height - 1, ILI9341_COLOR_WHITE);
    
    // Bottom and right edges (dark)
    ILI9341_DrawLine(btn->x, btn->y + btn->height - 1, btn->x + btn->width - 1, btn->y + btn->height - 1, ILI9341_COLOR_BLACK);
    ILI9341_DrawLine(btn->x + btn->width - 1, btn->y, btn->x + btn->width - 1, btn->y + btn->height - 1, ILI9341_COLOR_BLACK);
    
    // Inner shadow
    ILI9341_DrawRectangle(btn->x + 2, btn->y + 2, btn->width - 4, btn->height - 4, ILI9341_COLOR_BLACK);
}

uint8_t ILI9341_IsButtonPressed(Button_t *btn, uint16_t touch_x, uint16_t touch_y)
{
    return (touch_x >= btn->x && touch_x <= btn->x + btn->width &&
            touch_y >= btn->y && touch_y <= btn->y + btn->height);
}

/* Ana menu səhifəsi */
void ILI9341_ShowMainPage(void)
{
    current_page = 0;
    
    /* Qara fon */
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    /* Başlıq */
    ILI9341_DrawString(100, 20, "MAIN MENU", ILI9341_COLOR_WHITE, 0x0000, 3);
    
    /* Settings düyməsi */
    Button_t settings_btn = {20, 80, 130, 40, ILI9341_COLOR_BLUE, "Settings"};
    ILI9341_DrawButton(&settings_btn);
    ILI9341_DrawString(50, 95, "SETTINGS", ILI9341_COLOR_WHITE, 0x0000, 2);
    
    /* Test düyməsi */
    Button_t test_btn = {170, 80, 130, 40, ILI9341_COLOR_GREEN, "Test"};
    ILI9341_DrawButton(&test_btn);
    ILI9341_DrawString(200, 95, "TEST", ILI9341_COLOR_WHITE, 0x0000, 2);
    
    /* Info düyməsi */
    Button_t info_btn = {20, 140, 130, 40, ILI9341_COLOR_YELLOW, "Info"};
    ILI9341_DrawButton(&info_btn);
    ILI9341_DrawString(50, 155, "INFO", ILI9341_COLOR_WHITE, 0x0000, 2);
}

/* Touch test səhifəsi */
void ILI9341_ShowTouchTestPage(void)
{
    current_page = 4;
    
    /* Qara fon */
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    /* Başlıq */
    ILI9341_DrawRectangle(10, 5, 300, 20, ILI9341_COLOR_RED);
    ILI9341_DrawRectangle(12, 7, 296, 16, ILI9341_COLOR_WHITE);
    ILI9341_DrawString(120, 12, "TOUCH TEST", ILI9341_COLOR_RED, 0xFFFF, 1);
    
    /* Təlimatlar */
    ILI9341_DrawString(10, 37, "Touch the screen", ILI9341_COLOR_WHITE, 0x0000, 1);
    ILI9341_DrawString(10, 57, "to see red dots", ILI9341_COLOR_WHITE, 0x0000, 1);
    
    /* Geri düyməsi */
    Button_t back_btn = {20, 200, 280, 35, ILI9341_COLOR_RED, "Back"};
    ILI9341_DrawButton(&back_btn);
    ILI9341_DrawString(120, 215, "BACK TO MENU", ILI9341_COLOR_WHITE, 0x0000, 2);
}

/* Touch handling */
void ILI9341_HandleTouch(void)
{
    uint16_t raw_x, raw_y, screen_x, screen_y;
    
