valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
    /* Touch sensor işləyirmi test et */
    if (XPT2046_IsTouched()) {
        /* Raw koordinatları oxu */
        if (XPT2046_GetCoordinates(&raw_x, &raw_y)) {
            /* Raw koordinatları ekran koordinatlarına çevir */
            XPT2046_ConvertToScreen(raw_x, raw_y, &screen_x, &screen_y);
            
            /* Touch nöqtəsini göstərmə - silindi */
            
            /* Menu navigation */
            if (current_page == 0) { // Main page
                /* Settings button */
                if (screen_x >= 20 && screen_x <= 150 && screen_y >= 80 && screen_y <= 120) {
                    current_page = 1;
                    ILI9341_ShowSettingsPage();
                }
                /* Test button - geniş koordinatlar */
                else if (screen_x >= 160 && screen_x <= 310 && screen_y >= 70 && screen_y <= 130) {
                    /* Debug: Test düyməsi basıldı - ekranın mərkəzində böyük mavi dairə */
                    for(int i = -15; i <= 15; i++) {
                        for(int j = -15; j <= 15; j++) {
                            if ((i*i + j*j) <= 225) {
                                ILI9341_DrawPixel(160 + i, 120 + j, ILI9341_COLOR_BLUE);
                            }
                        }
                    }
                    current_page = 2;
                    ILI9341_ShowTestPage();
                }
                /* Info button */
                else if (screen_x >= 20 && screen_x <= 150 && screen_y >= 140 && screen_y <= 180) {
                    current_page = 3;
                    ILI9341_ShowInfoPage();
                }
            }
            else { // Other pages
                /* Back button - bütün ekran */
                if (screen_x >= 0 && screen_x <= 319 && screen_y >= 0 && screen_y <= 239) {
                    current_page = 0;
                    ILI9341_ShowMainPage();
                }
            }
        }
        
        HAL_Delay(200); /* Debounce */
    }
}

/* Touch debug - silindi */
void ILI9341_DebugTouch(void)
{
    /* Heçnə etmə */
}

/* Touch test - silindi */
void ILI9341_TestTouch(void)
{
    /* Heçnə etmə */
}

/* Settings səhifəsi */
void ILI9341_ShowSettingsPage(void)
{
    current_page = 1;
    
    /* Yaşıl fon */
    ILI9341_FillScreen(ILI9341_COLOR_GREEN);
    
    /* Başlıq */
    ILI9341_DrawRectangle(10, 10, 300, 30, ILI9341_COLOR_BLUE);
    ILI9341_DrawRectangle(12, 12, 296, 26, ILI9341_COLOR_WHITE);
    ILI9341_DrawString(120, 20, "SETTINGS", ILI9341_COLOR_BLUE, 0xFFFF, 2);
    
    /* Məzmun */
    ILI9341_DrawString(50, 60, "LCD: 320x240", ILI9341_COLOR_WHITE, 0x0000, 2);
    ILI9341_DrawString(50, 80, "Touch: XPT2046", ILI9341_COLOR_WHITE, 0x0000, 2);
    ILI9341_DrawString(50, 100, "MCU: STM32F407", ILI9341_COLOR_WHITE, 0x0000, 2);
    ILI9341_DrawString(50, 120, "Driver: ILI9341", ILI9341_COLOR_WHITE, 0x0000, 2);
    
    /* Geri düyməsi */
    Button_t back_btn = {20, 200, 280, 35, ILI9341_COLOR_RED, "Back"};
    ILI9341_DrawButton(&back_btn);
    ILI9341_DrawString(120, 215, "BACK TO MENU", ILI9341_COLOR_WHITE, 0x0000, 2);
}

/* Test səhifəsi */
void ILI9341_ShowTestPage(void)
{
    current_page = 2;
    
    /* Qırmızı fon */
    ILI9341_FillScreen(ILI9341_COLOR_RED);
    
    /* Başlıq */
    ILI9341_DrawRectangle(10, 10, 300, 30, ILI9341_COLOR_BLUE);
    ILI9341_DrawRectangle(12, 12, 296, 26, ILI9341_COLOR_WHITE);
    ILI9341_DrawString(140, 20, "TEST", ILI9341_COLOR_BLUE, 0xFFFF, 2);
    
    /* Test məzmunu */
    ILI9341_DrawString(50, 60, "Color Test: RED", ILI9341_COLOR_WHITE, 0x0000, 2);
    ILI9341_DrawString(50, 80, "Font Test: ABC abc 123", ILI9341_COLOR_WHITE, 0x0000, 2);
    ILI9341_DrawString(50, 100, "Touch Test: Touch buttons", ILI9341_COLOR_WHITE, 0x0000, 2);
    
    /* Geri düyməsi */
    Button_t back_btn = {20, 200, 280, 35, ILI9341_COLOR_RED, "Back"};
    ILI9341_DrawButton(&back_btn);
    ILI9341_DrawString(120, 215, "BACK TO MENU", ILI9341_COLOR_WHITE, 0x0000, 2);
}

/* Info səhifəsi */
void ILI9341_ShowInfoPage(void)
{
    current_page = 3;
    
    /* Sarı fon */
    ILI9341_FillScreen(ILI9341_COLOR_YELLOW);
    
    /* Başlıq */
    ILI9341_DrawRectangle(10, 10, 300, 30, ILI9341_COLOR_BLUE);
    ILI9341_DrawRectangle(12, 12, 296, 26, ILI9341_COLOR_WHITE);
    ILI9341_DrawString(140, 20, "INFO", ILI9341_COLOR_BLUE, 0xFFFF, 2);
    
    /* Məlumat */
    ILI9341_DrawString(50, 60, "STM32F407ZGT6", ILI9341_COLOR_BLACK, 0x0000, 2);
    ILI9341_DrawString(50, 80, "TFT 3.2 LCD", ILI9341_COLOR_BLACK, 0x0000, 2);
    ILI9341_DrawString(50, 100, "ILI9341 Driver", ILI9341_COLOR_BLACK, 0x0000, 2);
    ILI9341_DrawString(50, 120, "XPT2046 Touch", ILI9341_COLOR_BLACK, 0x0000, 2);
    ILI9341_DrawString(50, 140, "FSMC Interface", ILI9341_COLOR_BLACK, 0x0000, 2);
    
    /* Geri düyməsi */
    Button_t back_btn = {20, 200, 280, 35, ILI9341_COLOR_RED, "Back"};
    ILI9341_DrawButton(&back_btn);
    ILI9341_DrawString(120, 215, "BACK TO MENU", ILI9341_COLOR_WHITE, 0x0000, 2);
}

/* ------------------ Font funksiyaları ------------------ */
void ILI9341_DrawChar(uint16_t x, uint16_t y, char c, uint16_t color, uint16_t bgcolor, uint8_t size)
{
    if (c < 32 || c > 126) return;
    
    const uint8_t *font_data = &font_7x10.data[(c - 32) * 7];
    
    for (uint8_t i = 0; i < 7; i++) {
        uint8_t line = font_data[i];
        for (uint8_t j = 0; j < 10; j++) {
            if (line & (1 << j)) {
                // Pixel çək
                for (uint8_t sx = 0; sx < size; sx++) {
                    for (uint8_t sy = 0; sy < size; sy++) {
                        ILI9341_DrawPixel(x + i * size + sx, y + j * size + sy, color);
                    }
                }
            } else if (bgcolor != color) {
                // Background pixel çək
            for (uint8_t sx = 0; sx < size; sx++) {
                for (uint8_t sy = 0; sy < size; sy++) {
                        ILI9341_DrawPixel(x + i * size + sx, y + j * size + sy, bgcolor);
                    }
                }
            }
        }
    }
}

void ILI9341_DrawString(uint16_t x, uint16_t y, const char *str, uint16_t color, uint16_t bgcolor, uint8_t size)
{
    uint16_t start_x = x;
    while (*str) {
        if (*str == '\n') {
            y += 12 * size; // 10 + 2 space
            x = start_x;
        } else {
            ILI9341_DrawChar(x, y, *str, color, bgcolor, size);
            x += 8 * size; // 7 + 1 space
        }
        str++;
    }
}

