valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
/* ------------------ Pressure Control System ------------------ */

/* Global variables for pressure control system */
static uint8_t pressure_control_page = 0; // 0=main, 1=menu, 7=touch_cal, 8=pressure_cal, 9=pid_tune
// REMOVED: 2=pwm, 3=pressure_limit, 4=drv, 5=zme, 6=motor - PWM və PRES LIM bölmələri silindi
static float current_pressure = 0.0;
float pressure_limit = 300.0; // Default 300 bar (user limit) - exported for external access
static float drv_percent = 0.0;
static float zme_percent = 0.0;
static float motor_percent = 0.0;

/* PWM control variables */
static float drv_duty_cycle = 50.0;
static float drv_frequency = 1000.0;
static float zme_duty_cycle = 50.0;
static float motor_duty_cycle = 50.0;
static float motor_frequency = 1000.0;

/* Pressure sensor calibration variables */
/* Note: These are NOT static so AdvancedPressureControl can access them */
float min_voltage = 0.5;      /* Minimum voltage (0.5V) */
float max_voltage = 5.24;     /* Maximum voltage (5.24V) */
float min_pressure = 0.0;     /* DÜZƏLİŞ: Minimum pressure (0.0 bar - sıfır təzyiq) */
float max_pressure = 300.0;   /* Maximum pressure (300.0 bar) */
uint16_t adc_min = 410;       /* ADC value at minimum pressure (0.5V) */
uint16_t adc_max = 4096;      /* ADC value at maximum pressure (5.0V) */
static uint8_t calibration_mode = 0; /* 0=normal, 1=calibrate min, 2=calibrate max */

/* Precise conversion constants */
static const float P_PER_COUNT = 0.1048f;  /* bar per ADC count */
static const float P_OFFSET = -52.2f;      /* bar offset */
static const float BAR_PER_VOLT = 66.3228f; /* bar per volt */
static const float V_PER_COUNT = 0.00158f;  /* volt per ADC count */

/* Motor/DRV/ZME conversion constants */
static const float MOTOR_BAR_PER_PERCENT = 3.144f;    /* bar per 1% motor */
static const float MOTOR_PERCENT_PER_BAR = 0.3181f;  /* % per 1 bar motor */
static const float DRV_BAR_PER_PERCENT = 10.48f;     /* bar per 1% DRV (10-40% range) */
static const float DRV_PERCENT_PER_BAR = 0.09545f;   /* % per 1 bar DRV */
static const float ZME_BAR_PER_PERCENT = 10.48f;     /* bar per 1% ZME (0-30% range) */
static const float ZME_PERCENT_PER_BAR = 0.09545f;   /* % per 1 bar ZME */

/* Pressure limits for ZME control (separate from sensor calibration) */
static float zme_min_pressure = 3.5f;   /* minimum system pressure for ZME (bar) */
static float zme_max_pressure = 200.0f;  /* maximum system pressure for ZME (bar) */
static float zme_frequency = 1000.0f;  /* ZME PWM frequency in Hz */

// Button states
static uint8_t avto_active = 0;  // REMOVED but kept for compatibility
// stop_active - REMOVED (Stop button deleted)

// Auto mode control variables - REMOVED (AutoMode deleted)

/* Helper function to draw a button with text - no borders, white background */
void ILI9341_DrawControlButton(uint16_t x, uint16_t y, uint16_t width, uint16_t height, 
                               uint16_t color, const char* text, uint8_t text_size)
{
    // Draw button background (white by default, or specified color for special states)
    ILI9341_DrawRectangle(x, y, width, height, color);
    
    // No borders - clean white buttons
    
    // Draw text centered - black text on white background
    uint16_t text_x = x + (width - strlen(text) * 8 * text_size) / 2;
    uint16_t text_y = y + (height - 10 * text_size) / 2;
    ILI9341_DrawString(text_x, text_y, text, ILI9341_COLOR_BLACK, color, text_size);
}

/* Enhanced circular pressure gauge with better visualization */
void ILI9341_DrawPressureGauge(uint16_t center_x, uint16_t center_y, uint16_t radius, float pressure, float max_pressure)
{
    // Draw outer circle with thicker border
    for (int angle = 0; angle < 360; angle++) {
        int x = center_x + radius * cos(angle * 3.14159 / 180);
        int y = center_y + radius * sin(angle * 3.14159 / 180);
        if (x >= 0 && x < 320 && y >= 0 && y < 240) {
            ILI9341_DrawPixel(x, y, ILI9341_COLOR_WHITE);
            // Draw thicker border
            if (x > 0 && x < 319 && y > 0 && y < 239) {
                ILI9341_DrawPixel(x-1, y, ILI9341_COLOR_WHITE);
                ILI9341_DrawPixel(x+1, y, ILI9341_COLOR_WHITE);
                ILI9341_DrawPixel(x, y-1, ILI9341_COLOR_WHITE);
                ILI9341_DrawPixel(x, y+1, ILI9341_COLOR_WHITE);
            }
        }
    }
    
    // Draw scale marks (every 30 degrees)
    for (int mark = 0; mark < 6; mark++) {
        int angle = mark * 30;
        int x1 = center_x + (radius - 2) * cos((angle + 180) * 3.14159 / 180);
        int y1 = center_y + (radius - 2) * sin((angle + 180) * 3.14159 / 180);
        int x2 = center_x + (radius - 8) * cos((angle + 180) * 3.14159 / 180);
        int y2 = center_y + (radius - 8) * sin((angle + 180) * 3.14159 / 180);
        ILI9341_DrawLine(x1, y1, x2, y2, ILI9341_COLOR_WHITE);
    }
    
    // Draw pressure arc with color coding (0-180 degrees)
    float pressure_angle = (pressure / max_pressure) * 180.0;
    for (int angle = 0; angle < pressure_angle; angle++) {
        int x = center_x + (radius - 5) * cos((angle + 180) * 3.14159 / 180);
        int y = center_y + (radius - 5) * sin((angle + 180) * 3.14159 / 180);
        if (x >= 0 && x < 320 && y >= 0 && y < 240) {
            // Enhanced color coding with more zones
            uint16_t color;
            float percentage = (float)angle / 180.0;
            if (percentage < 0.3) {
                color = ILI9341_COLOR_GREEN;      // 0-30%: Green (Safe)
            } else if (percentage < 0.6) {
                color = ILI9341_COLOR_YELLOW;     // 30-60%: Yellow (Caution)
            } else if (percentage < 0.8) {
                color = ILI9341_COLOR_ORANGE;    // 60-80%: Orange (Warning)
            } else {
                color = ILI9341_COLOR_RED;       // 80-100%: Red (Danger)
            }
            ILI9341_DrawPixel(x, y, color);
        }
    }
    
    // Draw needle (pointer) showing current pressure
    if (pressure > 0) {
        float needle_angle = (pressure / max_pressure) * 180.0 + 180.0;
        int needle_x = center_x + (radius - 3) * cos(needle_angle * 3.14159 / 180);
        int needle_y = center_y + (radius - 3) * sin(needle_angle * 3.14159 / 180);
        ILI9341_DrawLine(center_x, center_y, needle_x, needle_y, ILI9341_COLOR_RED);
    }
    
    // Draw center dot
    ILI9341_DrawRectangle(center_x - 2, center_y - 2, 5, 5, ILI9341_COLOR_RED);
}

/* Main pressure control screen */
void ILI9341_ShowPressureControlMain(void)
{
    pressure_control_page = 0;
    
    // Clear screen
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    // Title at top - "HIGH PRESSURE CONTROL"
    ILI9341_DrawString(40, 15, "HIGH PRESSURE CONTROL", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    
    // Pressure gauge in center - slightly below title
    ILI9341_DrawPressureGauge(160, 80, 35, current_pressure, 300.0);
    
    // Pressure value display below gauge with enhanced formatting
    char pressure_str[25];
    if (current_pressure < 10.0) {
        sprintf(pressure_str, "%.2f BAR", current_pressure);  // 2 decimal for low values
    } else if (current_pressure < 100.0) {
        sprintf(pressure_str, "%.1f BAR", current_pressure);  // 1 decimal for medium values
    } else {
        sprintf(pressure_str, "%.0f BAR", current_pressure);   // No decimal for high values
    }
    ILI9341_DrawString(130, 125, pressure_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
    
    // Show pressure limit information
    extern float pressure_limit;
    char limit_str[30];
    sprintf(limit_str, "Limit: %.0f bar", pressure_limit);
    ILI9341_DrawString(10, 140, limit_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    
    // Show safety status
    if (current_pressure > (pressure_limit + 10.0f)) {
        ILI9341_DrawString(200, 140, "OVER LIMIT!", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
    } else if (current_pressure > pressure_limit) {
        ILI9341_DrawString(200, 140, "NEAR LIMIT", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    } else {
        ILI9341_DrawString(200, 140, "SAFE", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
    }
    
    // Control buttons (Menu) - below pressure display
    ILI9341_DrawControlButton(15, 150, 70, 35, ILI9341_COLOR_WHITE, "Menu", 1);
    // Auto button - REMOVED (AutoMode deleted)
    // Manual button - REMOVED (Manual mode deleted)
    // Stop button - REMOVED (Stop button deleted)
    
    /* Auto mode status display - REMOVED (AutoMode deleted) */
    
    /* Show pressure limit as target */
    char target_info[30];
    sprintf(target_info, "Target: %.1f bar", pressure_limit);
    ILI9341_DrawString(20, 210, target_info, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    
    /* Show valve status (for NO valves: 0% = open, 100% = closed) */
    char valve_status[50];
    sprintf(valve_status, "ZME:%s DRV:%s", 
            (zme_duty_cycle == 0.0) ? "OPEN" : "CLOSED",
            (drv_duty_cycle == 0.0) ? "OPEN" : "CLOSED");
    ILI9341_DrawString(20, 230, valve_status, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
}

