valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
                        printf("Calibration updated from UI - ADC: %.0f-%.0f, Pressure: %.2f-%.2f bar, Slope: %.6f, Offset: %.2f\r\n",
                               g_calibration.adc_min, g_calibration.adc_max, 
                               g_calibration.pressure_min, g_calibration.pressure_max,
                               g_calibration.slope, g_calibration.offset);
                        
                        // Save to flash using Advanced system
                        AdvancedPressureControl_SaveCalibration();
                        ILI9341_DrawString(200, 200, "SAVED!", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
                        HAL_Delay(1000); /* Show message for 1 second */
                        ILI9341_ShowMenuPage();
                    }
                    /* Back button - larger button */
                    else if (screen_x >= 20 && screen_x <= 110 && screen_y >= 240 && screen_y <= 280) {
                        ILI9341_ShowMenuPage();
                    }
                    break;

                case 9: // PID Tuning page
                    // SP - button (260-290, 40-70) - DÜZƏLİŞ: 10-10 dəyişir, düymə daha böyük
                    if (screen_x >= 260 && screen_x <= 290 && screen_y >= 40 && screen_y <= 70) {
                        SystemStatus_t* status = AdvancedPressureControl_GetStatus();
                        float new_sp = status->target_pressure - 10.0f;  // DÜZƏLİŞ: 1.0f əvəzinə 10.0f
                        if (new_sp < 0.0f) new_sp = 0.0f;
                        AdvancedPressureControl_SetTargetPressure(new_sp);
                        pressure_limit = new_sp; // Sync with old system if needed
                        ILI9341_ShowPIDTuningPage();  // Sürətli yeniləmə - delay yoxdur
                    }
                    // SP + button (295-325, 40-70) - DÜZƏLİŞ: 10-10 dəyişir, düymə daha böyük
                    else if (screen_x >= 295 && screen_x <= 325 && screen_y >= 40 && screen_y <= 70) {
                        SystemStatus_t* status = AdvancedPressureControl_GetStatus();
                        float new_sp = status->target_pressure + 10.0f;  // DÜZƏLİŞ: 1.0f əvəzinə 10.0f
                        if (new_sp > 300.0f) new_sp = 300.0f;
                        AdvancedPressureControl_SetTargetPressure(new_sp);
                        pressure_limit = new_sp; // Sync with old system if needed
                        ILI9341_ShowPIDTuningPage();  // Sürətli yeniləmə - delay yoxdur
                    }
                    // Layout coordinates must match ShowPIDTuningPage
                    // Kp - button (190-235, 75-105)
                    else if (screen_x >= 190 && screen_x <= 235 && screen_y >= 75 && screen_y <= 105) {
                        float new_kp = g_pid_zme.Kp - 0.1f;  // DÜZƏLİŞ: 0.1 addımı (format 0.1 olduğu üçün)
                        if (new_kp < 0.0f) new_kp = 0.0f;
                        // Update both ZME and DRV PID (they use same parameters)
                        AdvancedPressureControl_SetPIDParams(&g_pid_zme, new_kp, g_pid_zme.Ki, g_pid_zme.Kd);
                        AdvancedPressureControl_SetPIDParams(&g_pid_drv, new_kp, g_pid_drv.Ki, g_pid_drv.Kd);
                        printf("Kp dəyişdirildi: %.1f\r\n", new_kp);  // Debug mesajı
                        ILI9341_ShowPIDTuningPage();
                    }
                    // Kp + button (245-290, 75-105)
                    else if (screen_x >= 245 && screen_x <= 290 && screen_y >= 75 && screen_y <= 105) {
                        float new_kp = g_pid_zme.Kp + 0.1f;  // DÜZƏLİŞ: 0.1 addımı (format 0.1 olduğu üçün)
                        if (new_kp > 10.0f) new_kp = 10.0f;
                        // Update both ZME and DRV PID (they use same parameters)
                        AdvancedPressureControl_SetPIDParams(&g_pid_zme, new_kp, g_pid_zme.Ki, g_pid_zme.Kd);
                        AdvancedPressureControl_SetPIDParams(&g_pid_drv, new_kp, g_pid_drv.Ki, g_pid_drv.Kd);
                        printf("Kp dəyişdirildi: %.1f\r\n", new_kp);  // Debug mesajı
                        ILI9341_ShowPIDTuningPage();
                    }
                    // Ki - button (190-235, 115-145)
                    else if (screen_x >= 190 && screen_x <= 235 && screen_y >= 115 && screen_y <= 145) {
                        float new_ki = g_pid_zme.Ki - 0.001f;
                        if (new_ki < 0.0f) new_ki = 0.0f;
                        // Update both ZME and DRV PID (they use same parameters)
                        AdvancedPressureControl_SetPIDParams(&g_pid_zme, g_pid_zme.Kp, new_ki, g_pid_zme.Kd);
                        AdvancedPressureControl_SetPIDParams(&g_pid_drv, g_pid_drv.Kp, new_ki, g_pid_drv.Kd);
                        ILI9341_ShowPIDTuningPage();
                    }
                    // Ki + button (245-290, 115-145)
                    else if (screen_x >= 245 && screen_x <= 290 && screen_y >= 115 && screen_y <= 145) {
                        float new_ki = g_pid_zme.Ki + 0.001f;
                        if (new_ki > 1.0f) new_ki = 1.0f;
                        // Update both ZME and DRV PID (they use same parameters)
                        AdvancedPressureControl_SetPIDParams(&g_pid_zme, g_pid_zme.Kp, new_ki, g_pid_zme.Kd);
                        AdvancedPressureControl_SetPIDParams(&g_pid_drv, g_pid_drv.Kp, new_ki, g_pid_drv.Kd);
                        ILI9341_ShowPIDTuningPage();
                    }
                    // Kd - button (190-235, 155-185)
                    else if (screen_x >= 190 && screen_x <= 235 && screen_y >= 155 && screen_y <= 185) {
                        float new_kd = g_pid_zme.Kd - 0.05f;
                        if (new_kd < 0.0f) new_kd = 0.0f;
                        // Update both ZME and DRV PID (they use same parameters)
                        AdvancedPressureControl_SetPIDParams(&g_pid_zme, g_pid_zme.Kp, g_pid_zme.Ki, new_kd);
                        AdvancedPressureControl_SetPIDParams(&g_pid_drv, g_pid_drv.Kp, g_pid_drv.Ki, new_kd);
                        ILI9341_ShowPIDTuningPage();
                    }
                    // Kd + button (245-290, 155-185)
                    else if (screen_x >= 245 && screen_x <= 290 && screen_y >= 155 && screen_y <= 185) {
                        float new_kd = g_pid_zme.Kd + 0.05f;
                        if (new_kd > 5.0f) new_kd = 5.0f;
                        // Update both ZME and DRV PID (they use same parameters)
                        AdvancedPressureControl_SetPIDParams(&g_pid_zme, g_pid_zme.Kp, g_pid_zme.Ki, new_kd);
                        AdvancedPressureControl_SetPIDParams(&g_pid_drv, g_pid_drv.Kp, g_pid_drv.Ki, new_kd);
                        ILI9341_ShowPIDTuningPage();
                    }
                    // Back (20-100, 200-230)
                    else if (screen_x >= 20 && screen_x <= 100 && screen_y >= 200 && screen_y <= 230) {
                        ILI9341_ShowMenuPage();
                    }
                    // Save (220-300, 200-230)
                    else if (screen_x >= 220 && screen_x <= 300 && screen_y >= 200 && screen_y <= 230) {
                        // Save PID parameters to flash memory
                        AdvancedPressureControl_SavePIDParamsToFlash();
                        
