valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
    /* Convert percentage to compare value based on current period */
    uint32_t compare_value = (uint32_t)((duty_percent / 100.0) * period);
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, compare_value);
    
    /* Update global variable */
    drv_percent = duty_percent;
}

void PWM_SetZMEDutyCycle(float duty_percent)
{
    if (duty_percent < 0.0) duty_percent = 0.0;
    if (duty_percent > 100.0) duty_percent = 100.0;
    
    /* Get current timer period */
    uint32_t period = __HAL_TIM_GET_AUTORELOAD(&htim3);
    
    /* Convert percentage to compare value based on current period */
    uint32_t compare_value = (uint32_t)((duty_percent / 100.0) * period);
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, compare_value);
    
    /* Update global variable */
    zme_percent = duty_percent;
}

void PWM_SetMotorFrequency(float frequency_hz)
{
    if (frequency_hz < 100.0) frequency_hz = 100.0;
    if (frequency_hz > 10000.0) frequency_hz = 10000.0;
    
    /* Calculate period for desired frequency */
    /* Timer clock: 84MHz (APB1 * 2) */
    uint32_t timer_clock = 84000000; /* 84MHz */
    uint32_t period = (timer_clock / frequency_hz) - 1;
    
    /* Update timer period */
    __HAL_TIM_SET_AUTORELOAD(&htim3, period);
    
    /* Update global variable */
    motor_frequency = frequency_hz;
    
    /* Recalculate duty cycle with new period */
    PWM_SetMotorDutyCycle(motor_duty_cycle);
}

void PWM_UpdateAllChannels(void)
{
    /* Update all PWM channels with current values */
    PWM_SetMotorDutyCycle(motor_duty_cycle);
    PWM_SetDRVDutyCycle(drv_percent);
    PWM_SetZMEDutyCycle(zme_percent);
    PWM_SetMotorFrequency(motor_frequency);
}

void PWM_TestSequence(void)
{
    /* Test sequence for PWM to voltage converter module */
    
    /* Test 1: 0% duty cycle */
    PWM_SetMotorDutyCycle(0.0);
    HAL_Delay(2000);
    
    /* Test 2: 25% duty cycle */
    PWM_SetMotorDutyCycle(25.0);
    HAL_Delay(2000);
    
    /* Test 3: 50% duty cycle */
    PWM_SetMotorDutyCycle(50.0);
    HAL_Delay(2000);
    
    /* Test 4: 75% duty cycle */
    PWM_SetMotorDutyCycle(75.0);
    HAL_Delay(2000);
    
    /* Test 5: 100% duty cycle */
    PWM_SetMotorDutyCycle(100.0);
    HAL_Delay(2000);
    
    /* Return to 0% */
    PWM_SetMotorDutyCycle(0.0);
}

/* ==================== PRESSURE SENSOR CALIBRATION FUNCTIONS ==================== */

/* External ADC handle */
extern ADC_HandleTypeDef hadc3;

/* Function to check ADC pin configuration */
void PressureSensor_CheckPinConfiguration(void)
{
    /* Check if ADC3 is properly configured */
    if (hadc3.Instance != ADC3) {
        if (pressure_control_page == 0) {
            ILI9341_DrawString(10, 10, "ADC3 NOT CONFIGURED", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
        }
        return;
    }
    
    /* Check ADC channel configuration */
    if (hadc3.Init.Resolution != ADC_RESOLUTION_12B) {
        if (pressure_control_page == 0) {
            ILI9341_DrawString(10, 10, "ADC RESOLUTION ERROR", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
        }
        return;
    }
    
    /* Check if ADC is ready */
    if (HAL_ADC_GetState(&hadc3) != HAL_ADC_STATE_READY) {
        if (pressure_control_page == 0) {
            ILI9341_DrawString(10, 10, "ADC NOT READY", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
        }
        return;
    }
    
    /* ADC configuration is OK - no need to show on main page */
}

void PressureSensor_Calibrate(void)
{
    /* KRİTİK DÜZƏLİŞ: ADC oxunması PID sistemindən götürülür - ADC bloklanması yoxdur */
    SystemStatus_t* status = AdvancedPressureControl_GetStatus();
    uint16_t adc_value = status->raw_adc_value;  // Xam ADC dəyəri Status-dan
    
    if (calibration_mode == 1) {
        /* Calibrate minimum */
        adc_min = adc_value;
        calibration_mode = 0;
    }
    else if (calibration_mode == 2) {
        /* Calibrate maximum */
        adc_max = adc_value;
        calibration_mode = 0;
    }
}

/* 
 * REMOVED: PressureSensor_LoadCalibration() və PressureSensor_SaveCalibration() funksiyaları silindi
 * 
 * Bu funksiyalar artıq Advanced sistem funksiyaları ilə əvəz edilib:
 * - AdvancedPressureControl_LoadCalibration() - Flash-dan kalibrləmə yükləmə
 * - AdvancedPressureControl_SaveCalibration() - Flash-a kalibrləmə yazma
 * 
 * Kalibrləmə məntiqi yalnız Advanced sistem daxilində (advanced_pressure_control.c)
 * saxlanılmalıdır ki, vahid kalibrləmə məlumatları istifadə edilsin.
 */

/* 
 * REMOVED: PressureSensor_SaveCalibration() funksiyası silindi
 * 
 * Bu funksiya artıq AdvancedPressureControl_SaveCalibration() ilə əvəz edilib.
 * İstifadəçi UI-dan kalibrləmə dəyərlərini Advanced sistemə ötürür və Advanced sistem flash-a yazır.
 */

/* 
 * REMOVED: PressureSensor_ConvertToPressure() funksiyası silindi
 * 
 * Bu funksiya dublikat kalibrləmə məntiqinə səbəb olurdu.
 * Bunun əvəzinə AdvancedPressureControl_ReadPressure() istifadə edin.
 * 
 * Kalibrləmə məntiqi yalnız Advanced sistem daxilində (advanced_pressure_control.c)
 * saxlanılmalıdır ki, vahid kalibrləmə məlumatları istifadə edilsin.
 */

/* Convert pressure to motor percentage (0-100%) */
float PressureToMotorPercent(float pressure)
{
    if (pressure < min_pressure) pressure = min_pressure;
    if (pressure > max_pressure) pressure = max_pressure;
    
    /* Formula: Motor% = (P - 0.2) * 0.3181 */
    float motor_percent = (pressure - min_pressure) * MOTOR_PERCENT_PER_BAR;
    
    /* Clamp to 0-100% */
    if (motor_percent < 0.0f) motor_percent = 0.0f;
    if (motor_percent > 100.0f) motor_percent = 100.0f;
    
    return motor_percent;
}

/* Convert motor percentage to pressure */
float MotorPercentToPressure(float motor_percent)
{
    if (motor_percent < 0.0f) motor_percent = 0.0f;
    if (motor_percent > 100.0f) motor_percent = 100.0f;
    
    /* Formula: P = 0.2 + (Motor%) * 3.144 */
    float pressure = min_pressure + motor_percent * MOTOR_BAR_PER_PERCENT;
    
    return pressure;
}

/* Convert pressure to DRV percentage (10-40% range) */
float PressureToDRVPercent(float pressure)
{
    if (pressure < min_pressure) pressure = min_pressure;
    if (pressure > max_pressure) pressure = max_pressure;
    
