valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
    /* Formula: DRV% = 10 + (P - 0.2) * 0.09545 */
    float drv_percent = 10.0f + (pressure - min_pressure) * DRV_PERCENT_PER_BAR;
    
    /* Clamp to 10-40% */
    if (drv_percent < 10.0f) drv_percent = 10.0f;
    if (drv_percent > 40.0f) drv_percent = 40.0f;
    
    return drv_percent;
}

/* Convert pressure to ZME percentage (0-30% range, inverse) */
float PressureToZMEPercent(float pressure)
{
    if (pressure < zme_min_pressure) pressure = zme_min_pressure;
    if (pressure > zme_max_pressure) pressure = zme_max_pressure;
    
    /* ZME for pressure control: inverse relationship */
    /* At low pressure: ZME = 0% (open) - allow pressure to rise */
    /* At high pressure: ZME = 30% (closed) - prevent pressure overshoot */
    float pressure_range = zme_max_pressure - zme_min_pressure;
    float zme_percent = ((zme_max_pressure - pressure) / pressure_range) * 30.0f;
    
    /* ZME pressure control logic - improved */
    if (pressure < 10.0f) {
        zme_percent = 0.0f;  /* Very low pressure: ZME fully open for pressure rise */
    } else if (pressure > 150.0f) {
        zme_percent = 30.0f;  /* High pressure: ZME closed to prevent overshoot */
    }
    
    /* Clamp to 0-30% */
    if (zme_percent < 0.0f) zme_percent = 0.0f;
    if (zme_percent > 30.0f) zme_percent = 30.0f;
    
    return zme_percent;
}

/* IMPROVED debug function to check sensor status */
void PressureSensor_DebugStatus(void)
{
    /* KRİTİK DÜZƏLİŞ: ADC oxunması PID sistemindən götürülür - ADC bloklanması yoxdur */
    SystemStatus_t* status = AdvancedPressureControl_GetStatus();
    uint16_t raw_adc = status->raw_adc_value;  // Xam ADC dəyəri Status-dan
    
    /* Calculate voltage: V = (ADC / 4095) * 3.3V */
    float voltage = (float)raw_adc * 3.3f / 4095.0f;
    
    /* PID sistemindən təzyiq dəyərini götür */
    float pressure = status->current_pressure;
    
    /* Check for sensor problems - only show critical errors */
    if (raw_adc < 50) {
        /* Very low ADC - possible sensor disconnection */
        if (pressure_control_page == 0) {
            ILI9341_DrawString(10, 10, "SENSOR ERROR: Low ADC", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
        }
    } else if (raw_adc > 4000) {
        /* Very high ADC - possible sensor short circuit */
        if (pressure_control_page == 0) {
            ILI9341_DrawString(10, 10, "SENSOR ERROR: High ADC", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
        }
    }
    /* Normal reading - no debug clutter on main page */
    /* KRİTİK DÜZƏLİŞ: HAL_ADC_Stop() silindi - artıq manual ADC oxunması yoxdur */
    /* ADC dəyəri Status-dan götürülür, ona görə də Stop() lazım deyil */
}

void ILI9341_HandleCalibrationTouch(void)
{
    /* Handle calibration touch events */
    if (pressure_control_page == 8) {
        /* Update ADC reading display */
        static uint32_t last_adc_update = 0;
        uint32_t current_time = HAL_GetTick();
        
        if (current_time - last_adc_update > 200) { /* Update every 200ms for better responsiveness */
            last_adc_update = current_time;
            
            /* KRİTİK DÜZƏLİŞ: ADC oxunması PID sistemindən götürülür - ADC bloklanması yoxdur */
            SystemStatus_t* status = AdvancedPressureControl_GetStatus();
            uint16_t adc_value = status->raw_adc_value;  // Xam ADC dəyəri Status-dan
            
            /* Update display with current ADC value */
            char adc_str[30];
            sprintf(adc_str, "ADC: %d", adc_value);
            ILI9341_DrawString(20, 170, adc_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
            
            /* PID sistemindən təzyiq dəyərini götür */
            float current_pressure = status->current_pressure;
            char pressure_str[30];
            sprintf(pressure_str, "Pressure: %.1f bar", current_pressure);
            ILI9341_DrawString(20, 180, pressure_str, ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
            
            /* Show calibration values */
            char debug_cal_str[50];
            sprintf(debug_cal_str, "Cal: %d-%d -> %.1f-%.1f", adc_min, adc_max, min_pressure, max_pressure);
            ILI9341_DrawString(20, 190, debug_cal_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
            /* KRİTİK DÜZƏLİŞ: HAL_ADC_Stop() silindi - artıq manual ADC oxunması yoxdur */
            /* ADC dəyəri Status-dan götürülür, ona görə də Stop() lazım deyil */
        }
    }
}

/* ==================== AUTO MODE CONTROL FUNCTIONS ==================== */

/* AutoMode functions - REMOVED (AutoMode deleted) */
